// Задача 4: Напишите программу, которая на вход принимает натуральное число N, а на выходе показывает его цифры через запятую.

int N = int.Parse(Console.ReadLine()!);
float result =  (float) N/100;
Console.WriteLine(result);